{
	"rooms": {
		"light": {
			"text": "  You find yourself in a cold, dark room, dimly lit by a small lamp hovering near the middle of the ceiling.\n  A pillar lies beneath the lamp - upon it sits a TOKEN.\n  The only DOOR in the room sits opposite of you, above which hovers a dim, unlit LAMP.\n  You pick up a wand sitting in your lap [scroll MIDDLE MOUSE WHEEL to switch between the hand and the wand].",
			"doors": {
				"north": {
					"locked": true,
					"text": "  You stand in a square room; in the middle, sits a pillar, and above it hovers a lamp.\n  On the opposite end of the room, sits a door - above it, another lamp."
				}
			},
			"tokens": {
				"light": "  The token sits alone, atop the center of a pillar.",
			},
			"interactables": {
				"doorlamp": {
					"inactive": "  The lamp hovers above the door, dimly lit. You can barely see anything around it.",
					"activate": "  The lamp flicters, turning bright like the center lamp. A high-pitched tone rings out, and the magic sheild covering the door dissipates.",
					"active": "  The lamp hovers, brightly lit, like the lamp above the center of the room. You can see the door beneath it clearly."
				}
			}
		},
		"thermic": {
			"text": "  You enter a wide room filled with three doors, four pillars, and four lamps. There is a door at each end of the room, accompanied by two pillars, and over each pillar hovers a lamp. The third door sits to the side of the room.",
			"doors": {
				"south": {
					"locked": false,
					"text": "  You stand in the middle of the room, a door, with two pillars and lamps each, sits to the left and to the right."
				},
				"west": {
					"locked": true,
					"text": "  You stand at one end of the wide room; to your right and left, there is a pillar with a lamp overhead. In the middle of the room, to the right of you, sits a door. At the other end of the hall, a door, surrouned by a pillar and a lamp on each side."
				},
				"east": {
					"locked": true,
					"text": "  You stand at one end of the wide room; to your right and left, there is a pillar with a lamp overhead. In the middle of the room, to the left of you, sits a door. At the other end of the hall, a door, surrouned by a pillar and a lamp on each side."
				},
			},
			"tokens": {
				"fire": "  The token sits on a pillar, next to a wooden stump.",
				"cold": "  The token sits on a pillar, next to a bowl of water.",
			},
			"interactables": {
				"freeze": {
					"inactive": "  A bowl of water sits in the center of a pillar.",
					"activate": "  The water freezes, and the shield on the door near you dissipate.",
					"active": "  A frozen bowl of water sits in the center of a pillar."
				},
				"burn": {
					"inactive": "  A wooden stump sits in the center of a pillar.",
					"activate": "  The stump turns dark instantly, then slowly starts to glow and radiate heat; the shield on the door near you dissipate.",
					"active": "  A burning, wooden stump sits in the center of a pillar."
				},
				"swlamp": {
					"inactive": "  The lamp hovers near a jutting corner, dimly lit. You can barely see anything around it.",
					"activate": "  The lamp flicters, turning bright. You can now see a pillar beneath it, upon which sits a bowl of water.",
					"active": "  The lamp hovers, brightly lit; beneath it sits a pillar, upon which sits a bowl of water."
				},
				"nwlamp": {
					"inactive": "  The lamp hovers near a jutting corner, dimly lit. You can barely see anything around it.",
					"activate": "  The lamp flicters, turning bright. You can now see a pillar beneath it, upon which sits a bowl of ice.",
					"active": "  The lamp hovers, brightly lit; beneath it sits a pillar, upon which sits a bowl of ice."
				},
				"nelamp": {
					"inactive": "  The lamp hovers near a jutting corner, dimly lit. You can barely see anything around it.",
					"activate": "  The lamp flicters, turning bright. You can now see a pillar beneath it, upon which sits an empty bowl.",
					"active": "  The lamp hovers, brightly lit; beneath it sits a pillar, upon which sits an empty bowl."
				},
				"selamp": {
					"inactive": "  The lamp hovers near a jutting corner, dimly lit. You can barely see anything around it.",
					"activate": "  The lamp flicters, turning bright. You can now see a pillar beneath it, upon which sits a bowl of water.",
					"active": "  The lamp hovers, brightly lit; beneath it sits a pillar, upon which sits a bowl of water."
				}
			}
		},
		"boiler": {
			"text": "  You enter a small room with a large, cylindrical tank, made of bronze; there is a metal beam sticks out of one side of the tank; it connects to a small arm, which is connected to a wheel. Around the wheel is coiled part of a chain; the rest of the chain stretches across the room. On opposite end of the room, the chain winds around a few smaller wheels and connects to a barred gate, which blocks the door.",
			"doors": {
				"west": {
					"locked": false,
					"text": "  To your right, in the corner of the room, sits the metal tank. To your left, at the other end of the room, sits the barred door. In front of you, at the opposite corner of the room, the chain winds around the smaller wheels."
				},
				"north": {
					"locked": true,
					"text": "  To your left, in the corner nearest you, the chain winds around the smaller wheels. To your right, in the corner opposite to you, sits the metal tank. Behind you sits the barred door."
				},
			},
			"interactables": {
				"boiler": {
					"inactive": "  A metal tank, dull and silent.",
					"activate": "  The metal becomes shinier, and you can hear a dull, rumbling sound coming from within. As the sound grows, the metal beam sticking out of the tank begins to move outward, till suddenly, a burst of air screams out from the tank - the metal beam quickly recoiling back into the tank. As this action repeats, the large wheel moves, winding up the chain, which in turns, pulls the gate up until it no longer blocks the door.",
					"active": "  A shiny metal tank; you feel it's warmth."
				},
			}
		},
		"balloon": {
			"text": "the balloon room",
		},
		"lobby": {
			"text": "the lobby room",
		},
		"flywheel": {
			"text": "the flywheel room",
		},
		"piston": {
			"text": "the piston room",
		}
	},
	"tokens": {
		"light": "  A dot in the center, surrounded by two lines. The lines curve outward; the one above sweeping down and to the left, the one below sweeping up and to the right.",
		"fire": "  Two slanted, verticle lines, connected at the bottom, and curving up and away from each other.",
		"cold": "  A single, curved line, starting at the bottom left, sweeping up, then over to the right, then back down to the bottom.",
		"rotation": "  Four curved lines, encircling the middle of the token; they start on the inside, curving outward then sweeping counter-clockwise, pointing tangential to the center, forming a spiral.",
		"derotation": "  Four curved lines, encircling the middle of the token; they start on the inside, curving clockwise then outward, pointing away from the center, forming an anti-spiral."
	}
}
